# users/choice.py

GRADE_CHOICES = (
    ("선택안함", "선택안함"),
    ("1학년", "1학년"),
    ("2학년", "2학년"),
    ("3학년", "3학년"),
    ("4학년", "4학년"),
    ("졸업생", "졸업생"),
)

LEVEL_CHOICES = (
    ("3", "Lv3_미인증사용자"),
    ("2", "Lv2_인증사용자"),
    ("1", "Lv1_관리자"),
    ("0", "Lv0_개발자"),
)

CIRCLES_CHOICES = (
    ("선택안함", "선택안함"),
    ("1학년", "1학년"),
    ("2학년", "2학년"),
    ("3학년", "3학년"),
    ("4학년", "4학년"),
    ("졸업생", "졸업생"),
)

DEPARTMENT_CHOICES = (
    ("선택안함", "선택안함"),
    ("1학년", "1학년"),
    ("2학년", "2학년"),
    ("3학년", "3학년"),
    ("4학년", "4학년"),
    ("졸업생", "졸업생"),
)

CATEGORY_CHOICES = (
    ("자유", "자유"),
    ("질문", "질문"),
    ("정보", "정보"),
)